# TAKE HOME LAB EXERCISE

In [1]:
import pandas as pd

-----------------------

**Q.no (1) . Write a code to load 'employees.csv' as `df`.**

In [4]:
df=pd.read_csv("employees.csv")
df.head()

,Id,F_Name,S_Name,Sex,DOB,Department,Designation,Years_Exp,Location,Salary
0,1,Brown,Mia,Male,11/24/1987,Admin Offices,Accountant I,7,Bangalore,10000
1,2,LaRotonda,William,Male,4/26/1984,Admin Offices,Accountant I,8,Bangalore,10000
2,3,Steans,Tyrone,Male,09-01-1986,Admin Offices,Accountant I,7,Bangalore,10000
3,4,Howard,Estelle,Male,9/16/1985,Admin Offices,Administrative Assistant,4,Bangalore,15000
4,5,Singh,Nan,Male,5/19/1988,Admin Offices,Administrative Assistant,9,Bangalore,15000

----------------

**Q.no(2).Write a code to `MERGE`(`outer`)  df1 & df2 as `data`.**

In [44]:
df1=pd.read_csv("employees.csv")
df2=pd.read_csv("employees.csv")
data=pd.merge(df1,df2,how="outer",on='Id')
data.head()

,Id,F_Name_x,S_Name_x,Sex_x,DOB_x,Department_x,Designation_x,Years_Exp_x,Location_x,Salary_x,F_Name_y,S_Name_y,Sex_y,DOB_y,Department_y,Designation_y,Years_Exp_y,Location_y,Salary_y
0,1,Brown,Mia,Male,11/24/1987,Admin Offices,Accountant I,7,Bangalore,10000,Brown,Mia,Male,11/24/1987,Admin Offices,Accountant I,7,Bangalore,10000
1,2,LaRotonda,William,Male,4/26/1984,Admin Offices,Accountant I,8,Bangalore,10000,LaRotonda,William,Male,4/26/1984,Admin Offices,Accountant I,8,Bangalore,10000
2,3,Steans,Tyrone,Male,09-01-1986,Admin Offices,Accountant I,7,Bangalore,10000,Steans,Tyrone,Male,09-01-1986,Admin Offices,Accountant I,7,Bangalore,10000
3,4,Howard,Estelle,Male,9/16/1985,Admin Offices,Administrative Assistant,4,Bangalore,15000,Howard,Estelle,Male,9/16/1985,Admin Offices,Administrative Assistant,4,Bangalore,15000
4,5,Singh,Nan,Male,5/19/1988,Admin Offices,Administrative Assistant,9,Bangalore,15000,Singh,Nan,Male,5/19/1988,Admin Offices,Administrative Assistant,9,Bangalore,15000

----------------

**Q.no(3) . Write a code to `RENAME` the column from `salary` to `earnings`  of `employees dataset` and assign it to the new dataframe named as `data_01` .**

In [8]:
data_01=df.rename(columns={"Salary" : "earnings"})
data_01.head()

,Id,F_Name,S_Name,Sex,DOB,Department,Designation,Years_Exp,Location,earnings
0,1,Brown,Mia,Male,11/24/1987,Admin Offices,Accountant I,7,Bangalore,10000
1,2,LaRotonda,William,Male,4/26/1984,Admin Offices,Accountant I,8,Bangalore,10000
2,3,Steans,Tyrone,Male,09-01-1986,Admin Offices,Accountant I,7,Bangalore,10000
3,4,Howard,Estelle,Male,9/16/1985,Admin Offices,Administrative Assistant,4,Bangalore,15000
4,5,Singh,Nan,Male,5/19/1988,Admin Offices,Administrative Assistant,9,Bangalore,15000

-----------------

**Q.no(4) . Write a code to `drop` the column 'DOB' of `employees dataset` and assign it to the new dataframe named as `data_02`.**

In [10]:
data_02= df.drop(columns="DOB")
data_02.head()

,Id,F_Name,S_Name,Sex,Department,Designation,Years_Exp,Location,Salary
0,1,Brown,Mia,Male,Admin Offices,Accountant I,7,Bangalore,10000
1,2,LaRotonda,William,Male,Admin Offices,Accountant I,8,Bangalore,10000
2,3,Steans,Tyrone,Male,Admin Offices,Accountant I,7,Bangalore,10000
3,4,Howard,Estelle,Male,Admin Offices,Administrative Assistant,4,Bangalore,15000
4,5,Singh,Nan,Male,Admin Offices,Administrative Assistant,9,Bangalore,15000

-----------------

**Q.no(5) . Write a code to `drop` the `column no. 3 ` of `data_02` as per there `index position` .**

In [14]:
data_02.drop(columns = data_02.columns[2],inplace= True)
data_02.head()

,Id,F_Name,Sex,Department,Designation,Years_Exp,Location,Salary
0,1,Brown,Male,Admin Offices,Accountant I,7,Bangalore,10000
1,2,LaRotonda,Male,Admin Offices,Accountant I,8,Bangalore,10000
2,3,Steans,Male,Admin Offices,Accountant I,7,Bangalore,10000
3,4,Howard,Male,Admin Offices,Administrative Assistant,4,Bangalore,15000
4,5,Singh,Male,Admin Offices,Administrative Assistant,9,Bangalore,15000

-----------------

**Q.no(6). Write a code to replace all the `1` in the `year of experience` to `2` of `data_02`and assign it to the new dataframe named as `data_03`.**

In [45]:
data_03=data_02.copy()
data_03["Years_Exp"].replace({1:2},inplace=True)
data_03[data_03["Years_Exp"]==1]

Empty DataFrame
Columns: [Id, F_Name, Sex, Department, Designation, Years_Exp, Location, Salary]
Index: []

-----------------

**Q.no(7). Write a code to identify duplicates in `Designation` column and show a `count` of it from `data_02`.**

In [26]:
data_02["Designation"].value_counts()-1

Database Administrator      12
Network Engineer             8
IT Support                   3
Sr. DBA                      3
Sr. Network Engineer         2
Accountant I                 2
Administrative Assistant     2
IT Manager - DB              1
Sr. Accountant               1
Shared Services Manager      1
IT Director                  0
IT Manager - Support         0
President & CEO              0
IT Manager - Infra           0
CIO                          0
Name: Designation, dtype: int64

--------------

**Q.no(8). Write a code to show `average` `salary` of all the employees.**

In [30]:
data_02["Salary"].mean()

63700.0

---------------

**Q.no(9). Write a code to show mostly `designated position` for all the employees from employees dataset.**

In [32]:
data_02["Designation"].value_counts().index[0]

'Database Administrator'

----------------

**Q.no(10). Write a code to show the `average salary` for all `individual` `'designations'`.**

In [35]:
data_02[["Salary", "Designation"]].groupby(by ="Designation").mean()

                          Salary
Designation
Accountant I               10000
Administrative Assistant   15000
CIO                       120000
Database Administrator     50000
IT Director                75000
IT Manager - DB            75000
IT Manager - Infra         75000
IT Manager - Support       75000
IT Support                 80000
Network Engineer           85000
President & CEO           120000
Shared Services Manager    20000
Sr. Accountant             20000
Sr. DBA                    95000
Sr. Network Engineer      100000

-----------------

**Q.no(11). Write a code to show how much do the `salary` is `skewed` in `employees dataset`.**

In [37]:
data_02["Salary"].skew()

-0.32966939158331143

-------------------------

**Q.no(12). Write a code to show how much is the `kurtosis` in `salary` column for employees dataset.**

In [38]:
data_02["Salary"].kurtosis()

-0.8674403189534878

# --------------------------------------- HAPPY LEARNING --------------------------------------------

--------------------